[
  {
    "Id": 1,
    "title": "Syncrobit Helium (HNT) Miner",
    "description": "IoT: Hardware and Software Development for Helium (HNT) mining device. Complete embedded system design, firmware, and cloud integration for Syncrobit.",
    "category": "IoT",
    "image": "/portfolio/printedBoard-768x512.jpg",
    "tags": [
      "IoT",
      "Hardware",
      "Software"
    ],
    "client": "Syncro Bit",
    "challenge": "Designing a reliable, low-power Helium miner with secure wireless connectivity and robust cloud integration.",
    "solution": "Developed custom PCB, firmware, and a secure cloud dashboard. Integrated LoRaWAN and BLE for device management and data reporting.",
    "detail": "The Syncrobit Helium Miner project involved complete embedded system design for a next-generation Helium (HNT) mining device. Our team engineered the hardware, developed custom firmware, and integrated secure cloud connectivity. The device features robust wireless communication, low power consumption, and a user-friendly interface for device management. The project showcases our expertise in IoT, PCB design, and end-to-end product development.\n\n![Embedded System Design syncrob.it Helium Miner](/portfolio/printedBoard-768x512.jpg)",
    "models": [],
    "CompletedDate": "2025-10-23T00:00:00Z",
    "Status": "Completed"
  },
  {
    "Id": 2,
    "title": "Temperature and Humidity Monitoring System",
    "description": "IoT: End-to-end hardware and software for real-time temperature and humidity monitoring. Custom PCB, sensor integration, and cloud dashboard.",
    "category": "IoT",
    "image": "/portfolio/nrf52840_Top-Large-768x539.png",
    "tags": [
      "IoT",
      "Hardware",
      "Software"
    ],
    "client": "Industrial Client",
    "challenge": "Accurate, real-time monitoring in harsh industrial environments with remote data access.",
    "solution": "Designed ruggedized sensor nodes, implemented wireless data transmission, and built a web dashboard for analytics.",
    "detail": "This project delivered a robust temperature and humidity monitoring system for industrial environments. We designed custom PCBs using the nRF52840 platform, integrated high-accuracy sensors, and developed firmware for reliable wireless data transmission. The system includes a cloud dashboard for real-time analytics and alerting. Our solution ensures precise monitoring even in harsh conditions.\n\n![Temperature and Humidity Monitoring System top](/portfolio/nrf52840_Top-Large-768x539.png)",
    "models": [],
    "CompletedDate": "2025-08-23T00:00:00Z",
    "Status": "Completed"
  },
  {
    "Id": 3,
    "title": "Website Samples",
    "description": "Web Development: Portfolio of modern, responsive websites and web applications built for clients in various industries.",
    "category": "Web",
    "image": "/portfolio/botiga-free-woocommerce-wordpress-theme-1180x664-1.jpg",
    "tags": [
      "Web"
    ],
    "client": "Multiple Clients",
    "challenge": "Delivering high-performance, visually appealing, and mobile-friendly websites for diverse business needs.",
    "solution": "Developed custom themes, integrated CMS solutions, and optimized for SEO and speed.",
    "detail": "A showcase of modern, responsive websites and web applications built for clients in various industries. Our web development portfolio demonstrates expertise in UI/UX design, performance optimization, and seamless CMS integration. Each project is tailored to client needs, ensuring both functionality and visual appeal.\n\n![botiga-free-woocommerce-wordpress-theme-1180x664](/portfolio/botiga-free-woocommerce-wordpress-theme-1180x664-1.jpg)",
    "models": [],
    "CompletedDate": "2025-10-23T00:00:00Z",
    "Status": "Completed"
  },
  {
    "Id": 4,
    "title": "RK3588 Based High Speed IO Board",
    "description": "Hardware Development: High-speed IO board based on RK3588 SoC. Designed for industrial and research applications requiring fast data acquisition.",
    "category": "Hardware",
    "image": "/portfolio/top-1024x697.png",
    "tags": [
      "Hardware"
    ],
    "client": "Research Lab",
    "challenge": "Achieving high data throughput and signal integrity in a compact form factor.",
    "solution": "Engineered multi-layer PCB, implemented high-speed interfaces, and validated with lab testing.",
    "detail": "The RK3588 Based High Speed IO Board was developed for research and industrial applications requiring fast data acquisition. Our team engineered a multi-layer PCB with high-speed interfaces, ensuring signal integrity and reliability. The board was validated through extensive lab testing and is designed for scalability and performance.\n\n![RK3588 Based High Speed IO Board](/portfolio/top-1024x697.png)",
    "models": [],
    "CompletedDate": "2025-09-23T00:00:00Z",
    "Status": "Completed"
  },
  {
    "Id": 5,
    "title": "BLE Based Smart Putter Device",
    "description": "Hardware Development: Bluetooth Low Energy (BLE) enabled smart golf putter for real-time swing analysis and feedback.",
    "category": "Hardware",
    "image": "/portfolio/vertex-main.jpg",
    "tags": [
      "Hardware",
      "BLE"
    ],
    "client": "Vertex Golf",
    "challenge": "Integrating BLE electronics into a golf putter without affecting weight or balance.",
    "solution": "Designed miniaturized electronics, custom firmware, and a mobile app for swing data visualization.",
    "detail": "The BLE Based Smart Putter Device project involved designing a Bluetooth-enabled golf putter for real-time swing analysis. We engineered miniaturized electronics, developed custom firmware, and created a mobile app for data visualization. The device provides golfers with actionable insights while maintaining the traditional feel of a putter.\n\n![BLE Based Smart Putter Device](/portfolio/vertex-main.jpg)",
    "models": [],
    "CompletedDate": "2025-11-23T00:00:00Z",
    "Status": "Completed"
  },
  {
    "Id": 6,
    "title": "Self Scanning Solution",
    "description": "Hardware Development and Programming: Self-service scanning solution for retail and logistics. Embedded software, custom hardware, and seamless integration.",
    "category": "Hardware",
    "image": "/portfolio/slide1.jpg",
    "tags": [
      "Hardware",
      "Programming"
    ],
    "client": "Retail Client",
    "challenge": "Building a user-friendly, reliable self-scanning device for high-traffic retail environments.",
    "solution": "Developed ergonomic hardware, robust embedded software, and integrated with POS systems.",
    "detail": "Embeddronics partnered with scangoroo to develop a revolutionary self-scanning solution for retail. We designed the hardware for the scangoroo handle, integrating a scanner, scale, and interactive display. The device features robust construction, ergonomic design, and seamless integration with retail systems. Our work empowers a faster, cashless, and more convenient shopping experience.\n\n![Esp32 Scangoroo self-scanning solution](/portfolio/slide1.jpg)",
    "models": [],
    "CompletedDate": "2025-12-23T00:00:00Z",
    "Status": "Completed"
  }
]